<!-- dflook/terraform-github-actions {"workspace":"default","backend":"da580045d23d8802de84b06ba9800e01d4f8477735fde0851c282ddcddf10d87","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #263 at https://github.com/dflook/terraform-github-actions/actions/runs/3313813784","plan_hash":"90b46b97d45aeff77ac5827dac8e390dbec21bf1d66293c1f7722064ecb2f676","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "PSWMhdopux" -> (known after apply)
  ~ foreach = "SrnhDtiNtk" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #263](https://github.com/dflook/terraform-github-actions/actions/runs/3313813784)